"CalcError" = "Rechner-Fehler";
"SyntaxError" = "Syntax-Fehler";
"Message" = "Mitteilung";
"EvalError" = "Evaluations-Fehler";
"in line" = "in Zeile ";
"UnexpectedParenthesisAtPosition" = "Unerwartete Klammer an Position";
"CannotGraphExpression" = "Der Ausdruck in 'eq' kann nicht evaluiert, und daher auch nicht gezeichnet, werden.";

"OK" = "OK";
"GotIt" = "OK, verstanden";
"No" = "Ja";
"Yes" = "Nein";

"rpn:" = "upn:";
"alg:" = "alg:";


/* Welcome */
"Welcome" = "Willkommen.";
"WelcomeMsg" = "Bitte wählen Sie einen Rechnermodus. (Jederzeit wieder änderbar in 'Einstellungen'.)\nWählen Sie \"Klassisch\", wenn Sie HP UPN Rechner kennen.\nAnsonsten, wählen Sie \"Modern\".\n\nBitte besuchen Sie jetzt naivedesign.com/ND1 auf Ihrem Computer, und machen Sie die 'Quick Tour', um Ihren neuen Rechner kennenzulernen.";
"PleaseDoQuickTour" = "Bitte machen Sie die \"Quick Tour\" auf http://naivedesign.com/ND1";
"Classic" = "Klassisch";
"Modern" = "Modern";

/* ND0 */
"ND0_Overview" = "UPN Grafik-Taschenrechner";

/* Tips */
"GraphingTips" = "Grafik Tipps";
"GraphingTip" = "Tappen Sie ✓, um zum Stack zurückzukehren.\nZwei-Finger ziehen zum Verschieben, kneifen zum Zoomen.\nZwei-Finger Tapp für eine Bildschirmkopie.\nEinen Finger ziehen zum Digitalisieren. Einen Tapp, um die angezeigten Koordinaten in den Stack zu übernehmen.\nDoppeltapp zur Vollbildansicht.";
"DefinitionTips" = "Rechnerdefinition Tipps";
"DefinitionTip" = "Hier können Sie die Tasten und Menüs ändern.\nBeachten Sie, daß Tasten löschen und hinzufügen die gesamte Erscheinung beeinflußt.\n\nSie können immer wieder per 'Zurücksetzen' (am Ende der Liste) zum Originalzustand zurückkehren.";
"MyDataTips" = "Datenbank Tipps";
"MyDataTip" = "Hier ist Ihre Datenbank. Sie wird vom Rechner per vars-Taste erreicht.\n\nSie können Verzeichnisse, Variablen, Daten, Funktionen und Programme kreieren, bearbeiten und per Netz speichern und austauschen.";
"CustomSkinTips" = "Eigene Haut Tipp";
"CustomSkinTip" = "Mit der 'Eigenen Haut' können Sie Ihre eigenen Icons zur Tastendarstellung verwenden.\nGehen Sie in das 'Meine Haut' Verzeichnis in der Datenbank, tappen Sie 'Datenaustausch' und 'Links Lokalisieren', um Tastenbilder vom unserem Server zu laden.\nSobald Sie Ihre eigenen Icons haben, erstetzen Sie unsere Links mit Ihren und lokalisieren erneut.";

/* Emailing stack */
"MyStack" = "Mein Stapelspeicher";

/* Error msgs */
"Error" = "Fehler";
"Program execution error" = "Programmausführungsfehler";
"Detail" = "Detail";
"too few arguments on stack" = "zu wenige Argumente auf dem Stack";
"incorrect count of arguments on stack" = "inkorrekte Anzahl von Argumenten auf dem Stack";
"bad arg" = "falsches Argument";
"input is not a URL" = "Argument ist keine URL";
"invalid arg" = "ungültiges Argument";
"nonexistent PPAR variable" = "fehlende 'PPAR' Variable";
"no equation set (nonexistent eq variable)" = "keine Gleichung (fehlende 'eq' Variable)";
"wrong type of argument" = "falscher Argumententyp";
"requires display of a graphic" = "benötigt die Anzeige einer Graphik";
"unsupported arg" = "nicht unterstütztes Argument";
"unimplemented for binary word size of 32 bits; use smaller word" = "nicht implementiert für eine binäre Wortgröße von 32 Bit; wählen Sie eine kleinere Größe";
"incompatible dimensions" = "inkompatible Dimensionen";
"unsupported arg type" = "nicht unterstützter Argumententyp";
"bad index" = "ungültiger Index";
"zero determinant; cannot divide" = "Null Determinante; kann nicht dividieren";
"zero determinant; cannot compute inverse" = "Null Determinante; Inverse kann nicht bestimmt werden";
"bad arg 1: not a matrix" = "falsches erstes Argument: keine Matrize";
"matrix not square" = "Matrize nicht quadratisch";
"nonexistent ∑DAT" = "fehlende '∑DAT'";
"bad arg: not a matrix" = "falsches Argument: keine Matrize";
"invalid variable name: " = "ungültiger Variablenname: ";
"undefined name: " = "unbekannter Name: ";
"wrong parameter" = "falscher Parameter";
"invalid unit definition: " = "ungültige Einheitendefinition: ";
"unsupported unit definition(s): " = "nicht unterstützte Einheitendefinition(en): ";
"units do not share the same SI unit" = "Einheiten basieren nicht auf der selben SI Einheit";
"conversion unit(s) not defined." = "Konvertierungseinheit(en) nicht definiert";
"missing delimiter" = "fehlendes Endzeichen";
"missing expression or program in \u2192 statement" = "fehlender Ausdruck (oder Program) in \u2192 Block";
"missing IF" = "fehlendes IF";
"errant ELSE" = "unerwartetes ELSE";
"errant END" = "unerwartetes END";
"START lacks the 'from' and/or 'to' values on stack" = "START hat keine \"von\" und \"bis\" Werte auf dem Stack";
"missing START" = "fehlendes START";
"missing END" = "fehlendes END";
"missing ELSE or END" = "fehlendes ELSE oder END";
"missing REPEAT" = "fehlendes REPEAT";
"missing UNTIL" = "fehlendes UNTIL";
"infiniteLoopEncountered" = "eine unendliche FOR Schleife ist aufgetreten";
"unknown function" = "unbekannte Funktion";
"incorrect syntax" = "falsche Syntax";
"invalidDimensionsForData" = "ungültige Dimensionen für die gegebenen Bilddaten";
"hexDataExpected" = "Bildaten in hexadezimaler Form erwartet";
"SyntaxErrorInLine" = "(Wählen Sie 'Alles' und tappen erneut 'Enter', um die Fehlerposition zu sehen.)\n\nFehler in Zeile: ";
"resultTooLarge" = "Ergebnis zu gross";
"interrupted" = "Eingabe abgebrochen";
"required '=' missing in natural math definition" = "'=' fehlt in Natürlicher Mathe-Definition";
"missing closing parenthesis in natural math definition" = "schliessende Klammer fehlt in Natürlicher Mathe-Definition";
"malformed natural math definition" = "falsche Natürliche Mathe-Definition";

/* Tab Bar */
"CalculatorDefinition" = "Definition";
"Calculators" = "Rechner";
"ND1 (Classic)" = "ND1 (Klassisch)";
"My Data" = "Meine Daten";

/* Web View */
"SwitchingToFullView" = "Umschalten zur Vollbildansicht";
"DoubleTapToComeBack" = "Doppeltappen, um zum Rechner zurückzukommen.\nTappen Sie 'Verstanden', um diese Mitteilung nicht mehr zu bekommen.";
"DontTellMeAgain" = "Verstanden";

/* Calculator detail view */
"# functions:" = "Funktionen:";
"Add Calculator" = "Neuer Rechner";

/* Calculator Details */
"Type" = "Typ";
"Mode" = "Modus";
"RPN" = "UPN";
"Normal" = "Normal";
"Web Front-end" = "Web";
"Interactive" = "Interaktiv";
"Skin" = "Haut";
"Light" = "Hell";
"Dark" = "Dunkel";
"Metal" = "Metallisch";
"Custom" = "Meine Eigene";
"Default" = "Voreinstellung";
"Orientation" = "Format";
"Portrait" = "Hoch";
"Landscape" = "Quer";
"Any" = "Hoch oder quer";

"Keys" = "Tasten";
"Interface Elements" = "Benutzeroberflächenelemente";
"Add Key" = "Neue Taste";
"Add Interface Element" = "Neues Element";

"Menus" = "Menüs";
"Add Menu" = "Neues Menü";

/* Key detail */
"Key" = "Taste";
"Name" = "Name";
"Function" = "Funktion";

/* Menu detail */
"Menu" = "Menü";
"Title" = "Name";
"Soft Keys" = "Funktionstasten";
"Names" = "Namen";
"Functions" = "Funktionen";

/* Browse views */
"CreditsNotes" = "Anmerkungen";
"Injection" = "Injektion";
"Sharing" = "Datenaustausch";

/* Photo view */
"Photo" = "Foto";

/* User Category */
"Downloadables" = "Herunterladbares";
"SharedFolders" = "Ordner";
"SharedCalculators" = "Weitere Rechner";
"Updates" = "Updates";
"Available Folders" = "Verfügbare Ordner";
"ReachedFolderDownloadLimit" = "In ND0 können Sie nur ein paar Ordner herunterladen.\nFür unbegrenztes Herunterladen, erwägen Sie bitte den Kauf von ND1.";

/* User Category Add view */
"Add Category" = "Neuer Ordner";
"AddCategoryPlaceholder" = "Ordnername";

/* User Category detail view */
"Entry" = "Eintrag";
"OverviewPlaceholder" = "Beschreibung";
"nEntriesText" = "Einträge:";
"Entries" = "Einträge";
"Add Entry" = "Neuer Eintrag";

/* User Data Details */
"Name" = "Name";
"NamePlaceholder" = "Neuer Name";
"Definition" = "Definition";
"DefinitionPlaceholder" = "Definition (Datum oder Funktion)";
"Comment" = "Anmerkung";
"CommentPlaceholder" = "Anmerkung";

/* Special var store comments */
"CurrentEQ" = "Momentane Gleichung";
"PlotParams" = "Zeichenparameter";
"StatData" = "Statistische Daten";
"StatParams" = "Statistikparameter";
"Key Icon" = "Tastenbild";
"Current Equation" = "Momentane Gleichung";
"Plot Params" = "Zeichenparameter";
"Statistical Data" = "Statistische Daten";
"Stat. Params" = "Statistikparameter";

/* Sharing dialog */
"Email" = "Email";
"EmailText" = "Hallo,\n\nin der angefügten Datei sind die Daten für ";
"AlternativeDownload" = "Alternative";
"TryPublic" = "Wollen Sie versuchen eine öffentliche Version dieser Daten zu laden?";
"VisibleToThePublic" = "Sichtbar für Alle";
"CustomURL" = "Meine Austausch URL";
"Upload" = "Hochladen";
"Download" = "Herunterladen";
"DownloadAssets" = "Links Lokalisieren";
"CancelDownloadAssets" = "Lokalisierung Stoppen";
"ErrorOccurred" = "Ein Fehler ist aufgetreten";
"NoClientID" = "Keine Kennung";
"BadJSON" = "Die JSON Daten sind nicht korrekt. Bitte korrigieren Sie sie, und versuchen es dann wieder.";
"ResourceNotFound" = "Daten nicht auf dem Server vorhanden.";
"PageNotFound" = "Daten nicht auf dem Server vorhanden.";
"PleaseUpload" = "bitte Daten zuerst hochladen";
"LastUploadedOn" = "Zuletzt hochgeladen am";
"DirectConnect" = "Direktverbindung";
"Restore" = "Zurücksetzen";
"RestoreCalculator" = "Rechner Zurücksetzen";
"RestoreWarning" = "Warnung: Jedwede Änderungen gehen hierbei verloren!";

/* DB translations */
"Help" = "Hilfe";
"My Skin" = "Meine Haut";
"Custom Skin" = "Mein Eigener Look";
"My Vars" = "Variablen";
"Default Variable Store" = "Der Standard Variablenspeicher";
"Project X" = "Projekt X";
"An example collection of data" = "Eine Beispieldatensammlung";
"Stocks" = "Aktien";
"Quotes and Symbols" = "Echtzeitkurs und Tickersymbole";
"Units" = "Einheiten";
"Units Used for Conversions" = "Einheiten zum Konvertieren";
"APConstants" = "BP-Konstanten";
"Arbitrary Precision Constants" = "Konstanten mit beliebiger Präzision";
"Constants" = "Konstanten";
"Physical Constants" = "Physikalische Konstanten";
"Const" = "Konst";
"Examples" = "Beispiele";
"RPL + JavaScript Programming Examples" = "RPL + JavaScript Programmierungsbeispiele";
"From HP-28S User's Manual" = "Aus dem HP-28S Benutzerhandbuch";
"More Graphing Functions" = "Mehr Grafikfunktionen";
"Bessel Functions" = "Bessel Funktionen";
"Tools" = "Werkzeuge";
"Utility Functions" = "Nützliche Funktionen";
"Bench" = "Bench";
"Timing Functions" = "Funktionen zur Zeitmessung";
"Bills" = "Rechnungen";
"Sum up your bills" = "Rechnungen aufaddieren";
"Color" = "Farbe";
"Color type and functions" = "Farbtyp und -Funktionen";
"Chem" = "Chemie";
"Chemical formula type and functions" = "Chemischer Formeltyp";
"Plot" = "Plot";
"More Graphing Functions" = "Mehr Graph-Funktionen";
"Special Functions" = "Spezielle Funktionen";
"Bessel Functions" = "Bessel Funktionen";
"Programming Speed Tests" = "Geschwindigkeitstests";
"Niven Number Hunt" = "Niven-Zahlensuche";

"Key Icon" = "Tastenbild";
"Key Icon (pressed)" = "Tastenbild (gedrückt)";
"Alt-Key Icon" = "Alt-Tastenbild";
"Alt-Key Icon (pressed)" = "Alt-Tastenbild (gedrückt)";
"Background Image" = "Hintergrundbild";
"Change this to your URL" = "Ändern Sie dies zur Ihrer URL";
"My calculator background" = "Mein Rechner-Hintergrund";

"Mortgage" = "Kredite";
"Calculate Payments" = "Rückzahlungsberechnung";
"Unicodes" = "Unikode";
"Characters and Codes" = "Zeichen und Kode";
"Assorted Birthday Facts" = "Ausgesuchte Geburtstagsfakten";
"Downloader" = "Downloader";
"Scheduled URL Downloads" = "Geplantes URL Herunterladen";
"Financial Calculator" = "Finanzieller Rechner";
"Advanced Scientific Calculator" = "Wissenschaftlicher Rechner";
"Slide" = "Slide";
"New-Style Calculator" = "Rechner im neuen Stil";
"Unit Converter" = "Einheitenkonvertierer";
"Convert between a ton of units" = "Konvertieren zwischen vielen Einheiten";
"Visualize My Life" = "Visualisiere mein Leben";
"...one dot at a time" = "...Punkt für Punkt";
